{
  "main": {
    "name": "Alex Montague",
    "occupation": "Software Engineering Student ",
    "description": "I am always looking for ",
    "description2": ", whether that be open source projects, internships, or new technologies, ",
    "image": "profilepic.jpg",
    "bio": "I am a software engineer. Not only do I like to program, but I am passionate about writing clean, smart, and efficient code! Over my schooling and work terms I have been exposed to many languages and frameworks, but some of my favourite languages are Javascript, C and Java. I recently started my dive into web development, more specifically using the ReactJS/NodeJS libraries. I hope to explore more full stack opportunities in the future!",
    "contactmessage": "Drop me a line:",
    "email": "me@alexmontague.ca",
    "phone": "",
    "address": {
      "street": "(Your Street)",
      "city": "Toronto",
      "state": "Ontario",
      "zip": ""
    },
    "website": "https://www.alexmontague.ca",
    "resumedownload": "https://drive.google.com/file/d/1lp8AIoo5AEgERZ2K0S9hXAkdMOSO5y38/view",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/alex-montague/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/alexanderMontague",
        "className": "fa fa-github"
      },
      {
        "name": "stack overflow",
        "url": "https://stackoverflow.com/users/4372747/alex-montague",
        "className": "fa fa-stack-overflow"
      }
    ]
  },
  "resume": {
    "skillmessage": "Some technology I am passionate about, and an overview of my skills",
    "education": [
      {
        "school": "The University of Guelph",
        "degree": "Bachelors of Computing",
        "graduated": "Exp. April 2021",
        "description": "Currently in my third year studying Software Engineering. Some of the most interesting/favourite courses I have taken so far have been Software Design I - IV, Data Structures, Algorithms, Operating Systems and the infamous 'Angel of Death' (Software Systems and Integrations). Currently on the Dean's List for maintaining an overall average of 80%. I am looking forward to my databases and software design V class."
      },
      {
        "school": "Holy Trinity C.S.S",
        "degree": "O.S.S.D - Ontario Scholar",
        "graduated": "June 2016",
        "description": "Highschool is where I was first introduced to programming and computer science. I started learning the fundamentals using the Turing and Java programming languages. I graduated as an Ontario Scholar and maintained an overall average of 95% in all CIS courses."
      }
    ],
    "work": [
      {
        "company": "Coinsquare",
        "title": "Student Web Developer ",
        "years": "May 2018 - Present",
        "description": "Coinsquare is a 21st century financial institution specializing in trading and managing cryptocurrencies. Coinsquare was rated the 2nd most sought after startup in Canada by LinkedIn! I joined the team as a student web developer and have been working on our web application for both the front end and backend teams. As one of Coinsquare's first interns, I had the pleasure of participating and presenting in the first ever Coinsquare hackathon, as well as being able to be a fully functioning and independent developer! This was an absolutely amazing placement and I have learned so much not just about web development, but also about blockchain technology, project management, leadership and communication in an agile team! Check out an article I wrote about my experiences "
      },
      {
        "company": "Oakville Golf Club",
        "title": "Senior Greenskeeper",
        "years": "June 2014 - August 2017",
        "description": "Managed and led a team of junior employees on daily projects around the golf club such as coordinating the mowing of a specific area, or systematically cleaning up after weather. I also Interacted with different team members every day, to maintain and keep course conditions pristine while having a golf member centered mentality."
      }
    ],
    "techSkills": {
      "row1": [
        {
          "imageSrc": "images/react.png",
          "header": "ReactJS",
          "text": "I have been doing a lot of frontend work with the react library, and I absolutely love it! It is so versatile and is my go to for frontend web development. Pairing React with some other very powerful libraries and frameworks that I like (redux, axios, styled components) makes for a super strong frontend stack!"
        },
        {
          "imageSrc": "images/node.png",
          "header": "NodeJS",
          "text": "After recently branching out into backend web development, node, express and knex are some of the tools I am using to build my backend architecture. I am still learning lots about backend development!"
        }
      ],
      "row2": [
        {
          "imageSrc": "images/c.png",
          "header": "C",
          "text": "The C Programming language is the main language taught at UofG, and probably my strongest language. I liked the low-levelness of this language, and my algorithms and data structures classes all utilized C. Learning this language made me appreciate dynamic languages, but also allowed me to understand how they work behind the scenes."
        },
        {
          "imageSrc": "images/mysql.png",
          "header": "SQL",
          "text": "After learning SQL at school through projects, I was able use these skills at my current co-op where we utilized MySQL and PostgreSQL. I still have much to learn (and my upcoming databased course will help) in terms of relational databases, but I am also open and exploring non-relational databases such as MongoDB for personal use."
        }
      ],
      "row3": [
        {
          "imageSrc": "images/java.png",
          "header": "Java",
          "text": "Java is my favourite OO language and I have been programming with Java since highschool. I made my first graphical application with Java while working at my previous job, check it out below!"
        },
        {
          "imageSrc": "images/python.png",
          "header": "Python",
          "text": "Python is something I am still exploring/learning, but I am very interested in it as I would like to explore AI/Machine learning in the future. Not to mention no more curly braces and semicolons :)"
        }
      ]
    },
    "barSkills": [
      {
        "name": "ReactJS/Redux",
        "level": "90%"
      },
      {
        "name": "Git",
        "level": "80%"
      },
      {
        "name": "NodeJS/Express",
        "level": "70%"
      },
      {
        "name": "SQL",
        "level": "75%"
      },
      {
        "name": "HTML5/CSS3",
        "level": "90%"
      },
      {
        "name": "Data Structures / Algorithms",
        "level": "75%"
      },
      {
        "name": "Agile Methodologies",
        "level": "85%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Cryptowatch",
        "category": "An all in one web application to track and manage your crypto assets. No real money needed, just select the coin, the amount, and date bought and it will do the rest for you. This has been my first real web app that is constantly being developed.",
        "image": "cryptoWatch.gif",
        "url": "https://github.com/alexanderMontague/CryptoWatch"
      },
      {
        "title": "Coinsquare Dashboard",
        "category": "Dashboard application that was built in 4 hours for Coinsquare's first ever internal Hackathon. This dashboard allowed for constant monitoring of coinsquare's status, jira board, and Github PR data in a visualized way.",
        "image": "coinsquareDashboard.gif",
        "url": "https://alexandermontague.github.io/coinsquare-dashboard/"
      },
      {
        "title": "Awesome Ancestors",
        "category": "This program utilizes the GEDCOM file format (file format that reflects and displays ancestral data in a specific way. Used in sites like Ancestory.com), and was created for my 'Angel of Death' course. The program's main purpose is to read in a GEDCOM file, parse all information from the file, and manipulate the data to your liking. The program can create and edit new GEDCOM files, or modify existing files. The web client gives the user an interface to interact with and view the GEDCOM files.",
        "image": "awesomeAncestors.gif",
        "url": "https://github.com/alexanderMontague/Awesome-Ancestors"
      },
      {
        "title": "Greens Tracker",
        "category": "This Java application was created to record and display data recorded during a hand watering shift at my previous Golf Course. This information was usually kept on paper and was an overall inefficient process I wanted to make better.",
        "image": "greensTracker.gif",
        "url": "https://github.com/alexanderMontague/GreensTracker"
      },
      {
        "title": "Quick Query",
        "category": "A Perl based query program that allowed for queries of Canadian census and crime data both individually, and cross referenced. The results were then able to be graphed using R. Created for CIS*2250 Software Design 2.",
        "image": "quickQuery.png",
        "url": "https://github.com/alexanderMontague/Quick-Query"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "'One of the best programming skills you can have is knowing when to walk away for awhile.' - Oscar Godson.",
        "user": "I love to program, but love interacting even more. I am ready to work on new and exciting things, with new and exciting people!"
      }
    ]
  }
}
